#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Projecte : PyCharm
# @Date     : 2022-09-15 15:14
# @Author   : paperclub
# @Desc     :


import networkx as nx
import matplotlib.pyplot as plt

plt.rcParams['font.sans-serif'] = ['SimHei']
plt.rcParams['axes.unicode_minus'] = False


def demo():
    G = nx.Graph()

    # 设计关系
    G.add_node('客厅1', desc='我是白色客厅')
    G.add_node('客厅2', desc='我是红色客厅')
    G.add_node('厨房', desc='我是红色厨房')
    G.add_edge('客厅1', '客厅2', name='都是客厅', weight=50)
    G.add_edge('客厅2', '厨房', name='都是红色', weight=100)
    G.add_edge('客厅1', '厨房', name='都是室内', weight=20)

    pos = nx.spring_layout(G)  # 美化作用

    # 根据权重试验边赋值，绘制边
    elarge = [(u, v) for (u, v, d) in G.edges(data=True) if d["weight"] >= 50]
    esmall = [(u, v) for (u, v, d) in G.edges(data=True) if d["weight"] < 50]
    nx.draw_networkx_edges(G, pos, edgelist=elarge, width=10, edge_color="b", alpha=0.4, style='solid')
    nx.draw_networkx_edges(G, pos, edgelist=esmall, width=6, alpha=0.5, style="dashed")

    # 绘制点 + 边（可同上选其一）
    nx.draw(G, pos, node_color='y', edge_color='green', node_size=1000, alpha=0.5, style='dashdot')
    # style: 边的样式(默认为实现，可选： solid | dashed | dotted, dashdot)

    # 显示节点标签
    # nx.draw_networkx_labels(G, pos) ## 默认显示
    ### 方法1：自定义
    # node_labels = {}
    # for node in G.nodes:
    #     # node_labels[node] = G.nodes[node]
    #     node_labels[node] = 'Node: ' + str(node)
    # nx.draw_networkx_labels(G, pos, labels=node_labels, font_color='r', font_size=10)
    ### 方法2：使用属性
    descs = nx.get_node_attributes(G, 'desc')
    nx.draw_networkx_labels(G, pos, labels=descs, font_color='b')

    # 显示边标签
    # nx.draw_networkx_edge_labels(G, pos) # 默认显示
    ## 方法1：
    # edge_labels = {}
    # for edge in G.edges:
    #     edge_labels[edge] = G[edge[0]][edge[1]] # 全部属性
    #     edge_labels[edge] = f"arr: {G[edge[0]][edge[1]]['name']}"
    # nx.draw_networkx_edge_labels(G, pos, edge_labels=edge_labels)
    ## 方法2：使用属性
    names = nx.get_edge_attributes(G, 'name')
    nx.draw_networkx_edge_labels(G, pos, edge_labels=names)

    plt.show()


def demo2():
    d = {'id': 17,'entities': [('客厅', '场所类'), ('法式', '风格类'), ('法式', '风格类'), ('法式设计', '风格类'), ('装饰面', '家具物体'), ('雕花线条', '外形')], \
         'relations': [('客厅', '风格', '法式设计'), ('客厅', '风格', '法式'), ('客厅', '风格', '法式'), ('客厅', '物体', '装饰面'), ('装饰面', '纹理', '雕花线条')]}

    entities = list(set(d['entities']))
    relations = list(set(d['relations']))

    g = nx.DiGraph() # 有向

    # 添加实体节点
    for ent in entities:
        g.add_node(ent[0], desc=ent[1])

    # 添加关系边
    for rel in relations:
        g.add_edge(rel[0], rel[2], name=rel[1])

    # 标签名称
    nodes_labels = {}
    for i, node in enumerate(g.nodes):
        desc = entities[i][1]
        nodes_labels[node] = f"{node}\n({desc})"
    edgenames = nx.get_edge_attributes(g, 'name')

    pos = nx.spring_layout(g)
    nx.draw(g, pos, node_color='blue', alpha=0.5, node_size=2000, edge_color='gray', style='solid')
    nx.draw_networkx_labels(g, pos, labels=nodes_labels, font_color='white')
    nx.draw_networkx_edge_labels(g, pos, edge_labels=edgenames)

    print(g.degree)
    print(entities)
    print(relations)

    plt.show()


def demo3():
    from IPython.core.display import display, HTML
    from pyvis import network as net
    ## 组合数据
    jdat = [{'id': 17, 'entities': [('客厅', '场所类'), ('法式', '风格类'), ('法式', '风格类'), ('法式设计', '风格类'), ('装饰面', '家具物体'), ('雕花线条', '外形')], 'relations': [('客厅', '风格', '法式设计'), ('客厅', '风格', '法式'), ('客厅', '风格', '法式'), ('客厅', '物体', '装饰面'), ('装饰面', '纹理', '雕花线条')]}, {'id': 19, 'entities': [('客餐厅', '场所类'), ('墨白色', '色彩'), ('餐桌', '家具物体'), ('焦糖色', '色彩'), ('黄油沙发', '家具物体')], 'relations': [('客餐厅', '物体', '餐桌'), ('客餐厅', '物体', '黄油沙发'), ('餐桌', '颜色', '墨白色'), ('黄油沙发', '颜色', '焦糖色')]}, {'id': 20, 'entities': [('客厅', '场所类'), ('餐厅', '场所类'), ('背景墙', '家具物体'), ('电视柜', '家具物体'), ('木饰面', '组分'), ('木色', '色彩'), ('悬浮', '术语')], 'relations': [('客厅', '颜色', '木色'), ('餐厅', '颜色', '木色'), ('背景墙', '材质', '木饰面'), ('电视柜', '属性', '悬浮')]}, {'id': 21, 'entities': [('客厅', '场所类'), ('木材', '组分'), ('客厅', '场所类'), ('沙发', '家具物体'), ('高品格', '抽象风格'), ('高格调空间', '抽象风格'), ('背景墙', '家具物体')], 'relations': [('客厅', '物体', '沙发'), ('沙发', '属性', '高品格'), ('客厅', '风格', '高格调空间'), ('背景墙', '材质', '木材'), ('客厅', '物体', '背景墙')]}, {'id': 22, 'entities': [('影视墙', '家具物体'), ('木格栅', '组分'), ('大理石', '组分'), ('饰面板', '组分'), ('现代', '风格类'), ('客厅', '场所类'), ('自然感', '抽象风格'), ('艺术家具', '家具物体'), ('家居饰品', '家具物体')], 'relations': [('客厅', '风格', '现代'), ('影视墙', '材质', '木格栅'), ('影视墙', '材质', '大理石'), ('影视墙', '材质', '饰面板'), ('客厅', '物体', '影视墙'), ('客厅', '风格', '自然感'), ('客厅', '物体', '艺术家具'), ('家居饰品', '物体', '客厅')]}, {'id': 23, 'entities': [('布艺沙发', '家具物体'), ('浅色', '色彩'), ('深色', '色彩'), ('橡木', '组分'), ('边几', '家具物体'), ('电视背景', '家具物体')], 'relations': [('布艺沙发', '颜色', '浅色'), ('边几', '颜色', '深色'), ('边几', '材质', '橡木')]}, {'id': 24, 'entities': [('简约', '风格类'), ('筒灯', '家具物体'), ('黑白', '色彩'), ('大理石电视机柜', '家具物体'), ('黑色', '色彩'), ('无吊顶', '术语'), ('无主灯', '术语'), ('木格栅', '家具物体')], 'relations': [('大理石电视机柜', '颜色', '黑色'), ('木格栅', '颜色', '黑白')]}, {'id': 25, 'entities': [('客厅', '场所类'), ('沙发', '家具物体'), ('壁炉', '家具物体'), ('沙发', '家具物体'), ('软皮', '组分'), ('亚麻躺椅', '家具物体')], 'relations': [('沙发', '材质', '软皮'), ('客厅', '物体', '沙发'), ('客厅', '物体', '壁炉'), ('客厅', '物体', '沙发'), ('客厅', '物体', '亚麻躺椅'), ('沙发', '搭配', '亚麻躺椅')]}, {'id': 26, 'entities': [('客厅', '场所类'), ('电视背景墙', '家具物体'), ('木饰面', '组分'), ('大理石', '组分'), ('白色', '色彩'), ('灰色', '色彩'), ('胡桃木', '色彩'), ('高级质感', '抽象风格'), ('硬朗结合', '抽象风格'), ('一冷一暖', '抽象风格')], 'relations': [('电视背景墙', '材质', '木饰面'), ('电视背景墙', '材质', '大理石'), ('客厅', '颜色', '胡桃木'), ('客厅', '颜色', '白色'), ('客厅', '颜色', '灰色'), ('客厅', '物体', '电视背景墙'), ('客厅', '属性', '高级质感'), ('电视背景墙', '属性', '硬朗结合'), ('电视背景墙', '属性', '一冷一暖')]}, {'id': 27, 'entities': [('餐厅', '场所类'), ('木色', '色彩'), ('白色', '色彩'), ('客厅', '场所类')], 'relations': [('餐厅', '颜色', '木色'), ('餐厅', '颜色', '白色'), ('客厅', '颜色', '白色'), ('客厅', '颜色', '木色')]}, {'id': 28, 'entities': [('餐厅', '场所类'), ('客厅', '场所类'), ('墙面', '局部')], 'relations': [('餐厅', '方位', '墙面')]}, {'id': 30, 'entities': [('客厅', '场所类'), ('灰色', '色彩'), ('沙发', '家具物体'), ('皮质', '组分'), ('纯黑色', '色彩'), ('窗帘', '家具物体'), ('金色', '色彩'), ('挂画', '家具物体'), ('电视柜', '家具物体'), ('深灰色', '色彩'), ('仿古砖', '家具物体'), ('撞色', '色彩'), ('踢脚线', '家具物体')], 'relations': [('沙发', '材质', '皮质'), ('窗帘', '颜色', '纯黑色'), ('挂画', '颜色', '金色'), ('电视柜', '颜色', '撞色'), ('仿古砖', '颜色', '深灰色'), ('客厅', '物体', '窗帘'), ('客厅', '物体', '挂画'), ('客厅', '物体', '电视柜'), ('客厅', '物体', '仿古砖'), ('客厅', '物体', '踢脚线'), ('客厅', '物体', '沙发')]}, {'id': 31, 'entities': [('餐厅', '场所类'), ('横厅', '场所类'), ('入户空间', '场所类')], 'relations': []}, {'id': 32, 'entities': [('涂料', '术语'), ('石膏制品', '术语'), ('木制品', '术语')], 'relations': []}, {'id': 33, 'entities': [('小户型', '户型布局'), ('89平', '数量'), ('厨房与厕所', '场所类'), ('厨房', '场所类'), ('瓷砖', '家具物体')], 'relations': [('厨房与厕所', '面积', '89平'), ('小户型', '空间', '厨房与厕所'), ('小户型', '空间', '厨房')]}, {'id': 34, 'entities': [('北欧风', '风格类'), ('客厅', '场所类'), ('北欧', '风格类'), ('家具摆件', '术语'), ('设计师', '家具物体'), ('议\n4', '色彩'), ('️沙发墙是', '术语'), ('墙面', '家具物体'), ('是浅灰色\n', '家具物体'), ('⃣️', '色彩'), ('板是', '色彩'), ('客厅', '场所类')], 'relations': [('客厅', '风格', '北欧风'), ('客厅', '风格', '北欧'), ('客厅', '物体', '家具摆件'), ('设计师', '颜色', '议\n4'), ('墙面', '材质', '是浅灰色\n'), ('是浅灰色\n', '颜色', '⃣️'), ('是浅灰色\n', '颜色', '板是'), ('设计师', '属性', '️沙发墙是')]}, {'id': 35, 'entities': [('4w+', '数量'), ('105平方', '数量'), ('套内85', '数量'), ('2000', '数量'), ('400', '数量'), ('2900+', '数量'), ('2907', '数量'), ('两室两厅一厨一卫', '户型布局')], 'relations': [('4w+', '费用', '两室两厅一厨一卫'), ('两室两厅一厨一卫', '面积', '套内85'), ('两室两厅一厨一卫', '面积', '105平方')]}, {'id': 36, 'entities': [('寸\n', '场所类'), ('厅宽3.3', '数量'), ('墙宽3.', '数量'), ('m 电视背', '家具物体'), ('m\n', '场所类'), ('台深1.', '数量'), (' 与', '场所类'), ('了\n', '品牌'), ('宜家', '家具物体'), ('发长1.9', '数量'), (' 深0.98', '数量'), ('宜家电', '家具物体'), ('m\n', '品牌'), (' 长2.', '数量'), ('件把激光', '家具物体'), ('进了电', '家具物体'), ('宜家米多', '家具物体'), ('\n用', '品牌')], 'relations': [('寸\n', '宽', '厅宽3.3'), ('m 电视背', '宽', '墙宽3.'), ('m\n', '深', '台深1.'), ('宜家', '品牌名', '了\n'), ('宜家', '长', '发长1.9'), ('宜家', '深', ' 深0.98'), ('宜家电', '品牌名', 'm\n'), ('宜家电', '长', ' 长2.'), ('宜家米多', '品牌名', '\n用')]}, {'id': 37, 'entities': [('餐厅', '场所类'), ('三米', '数量'), ('原木餐桌', '家具物体'), ('马卡龙色系', '色彩'), ('吊灯', '家具物体'), ('童趣可爱', '抽象风格')], 'relations': [('原木餐桌', '长', '三米'), ('吊灯', '颜色', '马卡龙色系'), ('餐厅', '物体', '原木餐桌'), ('餐厅', '物体', '吊灯'), ('吊灯', '观点倾向', '童趣可爱')]}, {'id': 38, 'entities': [('庭院', '场所类'), ('餐厅', '场所类'), ('餐边柜', '家具物体'), ('吊灯', '家具物体'), ('简约', '风格类'), ('线条设计', '术语'), ('奢华又浪漫', '抽象风格'), ('黄铜', '组分')], 'relations': [('吊灯', '材质', '黄铜'), ('吊灯', '属性', '黄铜'), ('餐厅', '风格', '简约'), ('餐厅', '属性', '线条设计'), ('餐厅', '属性', '奢华又浪漫'), ('餐厅', '物体', '餐边柜'), ('餐厅', '物体', '吊灯')]}, {'id': 39, 'entities': [('现代', '风格类'), ('一体式布局', '户型布局'), ('客餐厅', '场所类'), ('客餐厅', '场所类'), ('木材', '组分'), ('大理石', '组分'), ('高格调空间', '抽象风格')], 'relations': [('客餐厅', '风格', '现代'), ('客餐厅', '风格', '现代'), ('客餐厅', '属性', '高格调空间'), ('一体式布局', '空间', '客餐厅'), ('一体式布局', '空间', '客餐厅')]}, {'id': 43, 'entities': [('餐桌', '家具物体'), ('黑白色', '色彩'), ('圆吊灯', '家具物体'), ('餐桌', '家具物体'), ('椅子', '家具物体'), ('椅子', '家具物体'), ('皮编', '组分'), ('窗边圆弧区域', '局部'), ('橡木', '组分')], 'relations': [('圆吊灯', '颜色', '黑白色'), ('椅子', '材质', '皮编'), ('窗边圆弧区域', '物体', '椅子'), ('餐桌', '材质', '橡木')]}, {'id': 45, 'entities': [('餐厅', '场所类'), ('现代', '风格类'), ('灯饰', '家具物体'), ('盆栽桌玩', '家具物体'), ('屏风', '家具物体'), ('中式家居', '风格类'), ('观赏性', '抽象风格'), ('东方韵味', '抽象风格'), ('中式', '风格类')], 'relations': [('餐厅', '风格', '现代'), ('灯饰', '属性', '中式'), ('餐厅', '风格', '中式家居'), ('餐厅', '物体', '灯饰'), ('餐厅', '物体', '盆栽桌玩'), ('餐厅', '属性', '观赏性'), ('餐厅', '属性', '东方韵味')]}, {'id': 46, 'entities': [('厨房', '场所类'), ('开放式', '户型布局'), ('餐厨一体', '户型布局')], 'relations': [('开放式', '空间', '厨房')]}, {'id': 48, 'entities': [('餐厅', '场所类'), ('圆桌', '家具物体'), ('大圆桌', '家具物体')], 'relations': [('餐厅', '物体', '圆桌'), ('餐厅', '物体', '大圆桌')]}, {'id': 49, 'entities': [('餐桌', '家具物体'), ('岛台', '家具物体'), ('餐桌', '家具物体'), ('岛台', '家具物体'), ('客餐厨一体', '户型布局')], 'relations': [('客餐厨一体', '物体', '餐桌'), ('客餐厨一体', '物体', '岛台'), ('客餐厨一体', '物体', '餐桌'), ('客餐厨一体', '物体', '岛台')]}, {'id': 50, 'entities': [('餐桌', '家具物体'), ('厨房', '场所类'), ('餐厅', '场所类'), ('餐桌', '家具物体'), ('餐厨一体', '户型布局')], 'relations': [('餐厅', '物体', '餐桌'), ('餐厨一体', '空间', '厨房'), ('餐厨一体', '空间', '餐厅'), ('餐厅', '物体', '餐桌')]}, {'id': 51, 'entities': [('餐厅', '场所类'), ('餐桌', '家具物体')], 'relations': [('餐厅', '物体', '餐桌')]}, {'id': 52, 'entities': [('餐厅', '场所类'), ('厨房', '场所类'), ('开放式设计', '户型布局'), ('餐桌', '场所类'), ('蓝白', '色彩'), ('吧台式', '术语')], 'relations': [('餐厅', '物体', '餐桌'), ('餐桌', '颜色', '蓝白'), ('开放式设计', '空间', '厨房'), ('开放式设计', '空间', '餐厅'), ('餐桌', '属性', '吧台式')]}, {'id': 53, 'entities': [('餐桌', '家具物体'), ('餐桌', '家具物体'), ('装饰画', '家具物体'), ('一桌四椅', '户型布局'), ('简洁时尚', '风格类')], 'relations': [('一桌四椅', '风格', '简洁时尚'), ('一桌四椅', '物体', '餐桌'), ('一桌四椅', '物体', '装饰画'), ('一桌四椅', '物体', '餐桌')]}, {'id': 55, 'entities': [('餐厅', '场所类'), ('餐桌椅', '家具物体'), ('定制柜', '家具物体'), ('茶具', '家具物体'), ('造型简单', '抽象风格'), ('时尚现代', '抽象风格'), ('典雅华丽', '抽象风格')], 'relations': [('餐厅', '物体', '餐桌椅'), ('餐厅', '物体', '定制柜'), ('餐厅', '物体', '茶具'), ('定制柜', '属性', '时尚现代'), ('茶具', '属性', '典雅华丽'), ('餐桌椅', '属性', '造型简单')]}, {'id': 57, 'entities': [('餐厅', '场所类'), ('客厅', '场所类'), ('灰色', '色彩'), ('墙面', '局部'), ('黑色', '色彩'), ('实木', '组分'), ('餐桌', '家具物体'), ('餐椅', '家具物体'), ('坐垫', '家具物体'), ('纸编', '组分'), ('餐椅', '家具物体'), ('灰色', '色彩'), ('布艺餐椅', '家具物体')], 'relations': [('墙面', '颜色', '灰色'), ('客厅', '方位', '墙面'), ('餐桌', '材质', '实木'), ('餐桌', '颜色', '黑色'), ('坐垫', '材质', '纸编'), ('布艺餐椅', '颜色', '灰色'), ('餐厅', '物体', '餐桌'), ('餐厅', '物体', '餐椅'), ('餐厅', '物体', '坐垫'), ('餐厅', '物体', '餐椅'), ('餐厅', '物体', '布艺餐椅')]}, {'id': 58, 'entities': [('客厅', '场所类'), ('现代简约风格', '风格类'), ('4w+', '数量'), ('客厅', '场所类'), ('北欧风格', '风格类'), ('4w', '数量')], 'relations': [('客厅', '风格', '现代简约风格'), ('客厅', '费用', '4w+'), ('客厅', '风格', '北欧风格'), ('客厅', '费用', '4w')]}, {'id': 59, 'entities': [('小阳台', '场所类'), ('餐厅', '场所类'), ('餐椅', '家具物体'), ('橘色', '色彩'), ('玻璃门', '家具物体'), ('厨房', '场所类')], 'relations': [('餐椅', '颜色', '橘色'), ('厨房', '物体', '玻璃门'), ('小阳台', '物体', '玻璃门')]}, {'id': 67, 'entities': [('厨房', '场所类'), ('墙裙', '家具物体'), ('烤漆门套', '家具物体')], 'relations': [('厨房', '物体', '墙裙'), ('厨房', '物体', '烤漆门套')]}, {'id': 68, 'entities': [('餐厅', '场所类'), ('客厅', '场所类'), ('吊灯', '家具物体'), ('山水禅意式', '风格类'), ('餐厅', '场所类'), ('中式风格', '风格类'), ('灯罩', '家具物体')], 'relations': [('山水禅意式', '属性', '吊灯'), ('餐厅', '物体', '吊灯'), ('餐厅', '风格', '中式风格'), ('餐厅', '物体', '灯罩')]}, {'id': 69, 'entities': [('黑色', '色彩'), ('餐桌椅', '家具物体'), ('护墙板面', '家具物体'), ('圆形', '外形'), ('餐边柜', '家具物体'), ('餐厅', '场所类'), ('意境', '家具物体')], 'relations': [('餐桌椅', '颜色', '黑色'), ('餐厅', '物体', '餐边柜'), ('餐厅', '物体', '护墙板面'), ('餐厅', '物体', '餐桌椅'), ('意境', '形状', '圆形')]}, {'id': 70, 'entities': [('小户型', '户型布局')], 'relations': []}, {'id': 71, 'entities': [('餐厅', '场所类'), ('厨房', '场所类'), ('餐厅', '场所类'), ('客厅', '场所类'), ('厨房门', '家具物体'), ('推拉玻璃门', '家具物体')], 'relations': [('厨房', '物体', '厨房门'), ('餐厅', '物体', '推拉玻璃门')]}, {'id': 72, 'entities': [('北欧风', '风格类'), ('5.2w+', '数量'), ('客厅和厨房', '场所类')], 'relations': [('客厅和厨房', '费用', '5.2w+'), ('客厅和厨房', '风格', '北欧风')]}, {'id': 73, 'entities': [('厨房', '场所类'), ('中西厨分离', '户型布局'), ('现代风', '风格类'), ('墙地砖', '局部'), ('简约', '风格类'), ('橱柜门', '家具物体'), ('无拉手设计', '术语'), ('厨房', '场所类'), ('餐桌', '家具物体')], 'relations': [('中西厨分离', '空间', '厨房'), ('墙地砖', '风格', '现代风'), ('橱柜门', '风格', '简约'), ('厨房', '物体', '餐桌'), ('橱柜门', '属性', '无拉手设计'), ('厨房', '方位', '墙地砖'), ('厨房', '物体', '橱柜门')]}, {'id': 74, 'entities': [('U型', '外形'), ('厨房', '场所类'), ('收纳柜', '家具物体'), ('落地桌', '家具物体')], 'relations': [('厨房', '形状', 'U型'), ('厨房', '物体', '收纳柜'), ('厨房', '物体', '落地桌')]}, {'id': 75, 'entities': [('客餐厅', '场所类'), ('大理石', '组分'), ('餐桌', '家具物体'), ('餐椅', '家具物体'), ('皮质', '组分'), ('餐厅', '场所类')], 'relations': [('餐桌', '材质', '大理石'), ('餐椅', '材质', '皮质'), ('客餐厅', '物体', '餐桌'), ('客餐厅', '物体', '餐椅')]}, {'id': 76, 'entities': [('餐厅', '场所类'), ('餐桌', '家具物体'), ('大理石', '组分'), ('白色', '色彩'), ('鱼骨吊灯', '家具物体')], 'relations': [('餐厅', '物体', '鱼骨吊灯'), ('餐厅', '物体', '餐桌'), ('餐桌', '材质', '大理石'), ('餐桌', '颜色', '白色')]}, {'id': 77, 'entities': [('厨房', '场所类'), ('砖', '家具物体'), ('环氧彩砂', '组分'), ('微水泥', '术语'), ('美缝', '家具物体'), ('橱柜', '家具物体'), ('胡桃木', '组分'), ('地柜', '家具物体'), ('吊柜', '家具物体'), ('暖白色', '色彩')], 'relations': [('砖', '属性', '微水泥'), ('美缝', '材质', '环氧彩砂'), ('地柜', '材质', '胡桃木'), ('吊柜', '颜色', '暖白色'), ('厨房', '物体', '砖'), ('厨房', '物体', '美缝'), ('厨房', '物体', '橱柜')]}, {'id': 78, 'entities': [('L型', '外形'), ('厨房', '场所类'), ('厨房', '场所类'), ('中高柜', '家具物体')], 'relations': [('厨房', '物体', '中高柜'), ('厨房', '形状', 'L型')]}, {'id': 79, 'entities': [('厨房', '场所类'), ('吊柜', '家具物体'), ('柜子', '家具物体'), ('集成灶', '家具物体')], 'relations': [('厨房', '物体', '吊柜'), ('厨房', '物体', '柜子'), ('厨房', '物体', '集成灶')]}, {'id': 80, 'entities': [('厨房', '场所类'), ('推拉门', '家具物体'), ('玻璃', '组分'), ('U型', '外形'), ('橱柜', '家具物体'), ('小方砖', '组分'), ('彩色', '色彩'), ('隔断', '局部'), ('墙面', '局部')], 'relations': [('推拉门', '材质', '玻璃'), ('橱柜', '形状', 'U型'), ('厨房', '物体', '橱柜'), ('小方砖', '颜色', '彩色'), ('墙面', '材质', '小方砖'), ('厨房', '方位', '墙面'), ('厨房', '方位', '隔断'), ('隔断', '物体', '推拉门')]}, {'id': 81, 'entities': [('封闭式', '户型布局'), ('厨房', '场所类'), ('柜子', '家具物体'), ('厨房', '场所类'), ('现代高级感', '抽象风格')], 'relations': [('封闭式', '空间', '厨房'), ('厨房', '物体', '柜子'), ('厨房', '属性', '现代高级感')]}, {'id': 83, 'entities': [('厨房', '场所类'), ('阳台', '场所类'), ('洗衣机', '家具物体'), ('内嵌式', '术语'), ('烘干机', '家具物体'), ('晾衣区', '局部'), ('阳台外', '场所类'), ('露台', '局部'), ('开放式厨房', '术语')], 'relations': [('洗衣机', '属性', '内嵌式'), ('阳台外', '方位', '露台'), ('阳台', '物体', '洗衣机'), ('阳台', '物体', '烘干机'), ('阳台外', '方位', '晾衣区')]}, {'id': 85, 'entities': [('厨房', '场所类'), ('餐厅', '场所类'), ('厨房', '场所类'), ('餐厅', '场所类'), ('餐边柜', '家具物体'), ('餐边柜', '家具物体')], 'relations': []}, {'id': 86, 'entities': [('餐厨区', '场所类'), ('地面', '局部'), ('花砖', '组分'), ('储物柜', '家具物体')], 'relations': [('地面', '材质', '花砖'), ('餐厨区', '方位', '地面'), ('餐厨区', '物体', '储物柜')]}, {'id': 88, 'entities': [('书房', '场所类'), ('一字型', '外形'), ('长桌', '家具物体'), ('折叠椅', '家具物体'), ('推拉窗', '家具物体')], 'relations': [('长桌', '形状', '一字型'), ('书房', '物体', '长桌'), ('书房', '物体', '折叠椅'), ('书房', '物体', '推拉窗')]}, {'id': 89, 'entities': [('淡蓝色', '色彩'), ('主卧', '场所类'), ('墙面', '局部')], 'relations': [('墙面', '颜色', '淡蓝色'), ('主卧', '方位', '墙面')]}, {'id': 90, 'entities': [('小次卧', '场所类'), ('按摩椅', '家具物体'), ('电竞房', '场所类'), ('酷黑风格', '风格类')], 'relations': [('电竞房', '风格', '酷黑风格'), ('电竞房', '物体', '按摩椅')]}, {'id': 91, 'entities': [('边柜', '家具物体'), ('红木', '组分')], 'relations': [('边柜', '材质', '红木')]}, {'id': 92, 'entities': [('落地窗', '家具物体'), ('客厅', '场所类'), ('儿童房', '场所类'), ('蓝色系', '色彩'), ('灰色', '色彩'), ('布艺床', '家具物体'), ('简雅现代风情', '风格类')], 'relations': [('客厅', '物体', '落地窗'), ('布艺床', '颜色', '灰色'), ('布艺床', '颜色', '蓝色系'), ('儿童房', '物体', '布艺床'), ('客厅', '风格', '简雅现代风情')]}, {'id': 93, 'entities': [('镜面储物柜', '家具物体'), ('玄关走道', '局部')], 'relations': [('玄关走道', '物体', '镜面储物柜')]}, {'id': 94, 'entities': [('卫生间', '场所类'), ('白色', '色彩'), ('花砖', '组分'), ('卫浴空间', '场所类'), ('干湿分离', '户型布局'), ('地面', '局部')], 'relations': [('地面', '材质', '花砖'), ('卫生间', '颜色', '白色'), ('卫生间', '方位', '地面'), ('干湿分离', '空间', '卫浴空间')]}, {'id': 96, 'entities': [('斗柜', '家具物体'), ('挂画', '家具物体'), ('组合柜', '家具物体'), ('柜子', '家具物体')], 'relations': []}, {'id': 98, 'entities': [('柜子', '家具物体'), ('入门处', '局部'), ('换鞋凳', '家具物体')], 'relations': [('入门处', '物体', '柜子'), ('入门处', '物体', '换鞋凳')]}, {'id': 99, 'entities': [('暖白', '色彩'), ('原木色', '色彩'), ('玄关柜', '家具物体'), ('入门玄关', '局部'), ('玄关柜', '家具物体'), ('灯带', '家具物体')], 'relations': [('玄关柜', '颜色', '原木色'), ('玄关柜', '颜色', '暖白'), ('入门玄关', '物体', '玄关柜')]}, {'id': 100, 'entities': [('玻璃房', '场所类'), ('干湿分离', '户型布局'), ('洗漱区', '局部'), ('淋浴区', '局部')], 'relations': [('玻璃房', '方位', '洗漱区'), ('玻璃房', '方位', '淋浴区'), ('干湿分离', '空间', '玻璃房')]}, {'id': 101, 'entities': [('干湿分离', '户型布局')], 'relations': []}, {'id': 107, 'entities': [('卫生间', '场所类'), ('洗漱区', '局部')], 'relations': [('卫生间', '方位', '洗漱区')]}, {'id': 109, 'entities': [('卫生间', '场所类'), ('台盆', '家具物体'), ('卫生间', '场所类'), ('干式分离', '户型布局')], 'relations': [('卫生间', '物体', '台盆'), ('干式分离', '空间', '卫生间'), ('干式分离', '空间', '卫生间')]}, {'id': 111, 'entities': [('公卫', '场所类'), ('三分离', '户型布局'), ('洗漱台', '家具物体'), ('浴室', '场所类'), ('浴室门', '家具物体'), ('三推拉门', '术语')], 'relations': [('三分离', '空间', '公卫'), ('浴室门', '属性', '三推拉门'), ('公卫', '物体', '洗漱台')]}, {'id': 113, 'entities': [('卧室', '场所类'), ('现代简约', '风格类'), ('落地窗', '家具物体')], 'relations': [('卧室', '风格', '现代简约'), ('卧室', '物体', '落地窗')]}, {'id': 114, 'entities': [('水泥面', '组分'), ('白色', '色彩'), ('大地砖', '家具物体'), ('白色', '色彩'), ('厨房', '场所类'), ('2.6米', '数量'), ('0.6米', '数量'), ('柜子', '家具物体'), ('1.4米', '数量'), ('墙上', '局部'), ('集成吊顶', '家具物体'), ('过道', '局部'), ('厨房', '场所类'), ('柜门', '家具物体')], 'relations': [('大地砖', '颜色', '白色'), ('厨房', '宽', '2.6米'), ('柜子', '宽', '0.6米'), ('墙上', '材质', '大地砖'), ('集成吊顶', '颜色', '白色'), ('过道', '宽', '1.4米'), ('厨房', '方位', '过道'), ('厨房', '物体', '柜门'), ('水泥面', '材质', '柜门'), ('厨房', '物体', '大地砖'), ('厨房', '方位', '墙上'), ('厨房', '物体', '集成吊顶')]}, {'id': 115, 'entities': [('三分离式', '户型布局'), ('卫生间', '场所类'), ('干湿分离', '户型布局'), ('卫生间', '场所类')], 'relations': [('三分离式', '空间', '卫生间'), ('干湿分离', '空间', '卫生间')]}, {'id': 116, 'entities': [('弧形', '外形'), ('入户玄关', '局部'), ('组合柜', '家具物体'), ('鞋柜', '家具物体'), ('玄关', '局部'), ('天然大理石', '家具物体')], 'relations': [('入户玄关', '形状', '弧形'), ('玄关', '物体', '天然大理石')]}, {'id': 119, 'entities': [('隔断', '局部'), ('卫浴空间', '场所类'), ('透明玻璃', '组分'), ('瓷砖', '组分'), ('墙面', '局部')], 'relations': [('隔断', '材质', '透明玻璃'), ('卫浴空间', '方位', '隔断'), ('墙面', '材质', '瓷砖'), ('卫浴空间', '方位', '墙面')]}, {'id': 120, 'entities': [('主卫', '场所类'), ('客卫', '场所类'), ('灰色调', '色彩'), ('墙面', '局部'), ('白色', '色彩'), ('瓷砖', '家具物体'), ('墙地一体', '术语')], 'relations': [('瓷砖', '颜色', '白色'), ('墙面', '材质', '瓷砖'), ('客卫', '方位', '墙面'), ('主卫', '属性', '墙地一体'), ('主卫', '颜色', '灰色调')]}, {'id': 121, 'entities': [('卫生间', '场所类'), ('干湿分离', '户型布局'), ('智能马桶', '家具物体'), ('镜面一体化', '术语')], 'relations': [('干湿分离', '空间', '卫生间'), ('卫生间', '物体', '智能马桶'), ('卫生间', '属性', '镜面一体化')]}, {'id': 122, 'entities': [('干区', '场所类'), ('淋浴间', '场所类'), ('洗脸池', '家具物体'), ('1.6米', '数量'), ('悬空', '术语'), ('双盆', '外形'), ('柜子', '家具物体'), ('墙地砖', '局部'), ('客卫', '场所类'), ('灰色系', '色彩'), ('壁龛', '家具物体'), ('悬空', '术语')], 'relations': [('洗脸池', '属性', '悬空'), ('洗脸池', '形状', '双盆'), ('洗脸池', '宽', '1.6米'), ('干区', '物体', '洗脸池'), ('干区', '物体', '柜子'), ('客卫', '方位', '墙地砖'), ('淋浴间', '物体', '壁龛'), ('墙地砖', '颜色', '灰色系'), ('柜子', '属性', '悬空')]}, {'id': 123, 'entities': [('主卧', '场所类'), ('暖灰色', '色彩'), ('烤漆格栅', '家具物体'), ('矮塌床', '家具物体'), ('床尾凳', '家具物体')], 'relations': [('烤漆格栅', '颜色', '暖灰色'), ('主卧', '物体', '烤漆格栅'), ('主卧', '物体', '矮塌床'), ('主卧', '物体', '床尾凳')]}, {'id': 124, 'entities': [('卫生间', '场所类'), ('三分离设计', '户型布局')], 'relations': [('三分离设计', '空间', '卫生间')]}, {'id': 125, 'entities': [('主卧', '场所类'), ('独立卫生间', '场所类'), ('主卫', '场所类'), ('门窗', '家具物体'), ('透明玻璃', '组分')], 'relations': [('主卫', '物体', '门窗'), ('门窗', '材质', '透明玻璃'), ('主卧', '属性', '独立卫生间')]}, {'id': 126, 'entities': [('鞋柜', '家具物体'), ('镜子', '家具物体'), ('鞋柜', '家具物体'), ('鞋柜', '家具物体'), ('柜子', '家具物体')], 'relations': []}, {'id': 128, 'entities': [('卫生间', '场所类'), ('大理石', '家具物体'), ('墙地面', '局部'), ('深灰色调', '色彩'), ('大气沉稳', '抽象风格')], 'relations': [('卫生间', '方位', '墙地面'), ('墙地面', '材质', '大理石'), ('大理石', '颜色', '深灰色调'), ('卫生间', '属性', '大气沉稳')]}, {'id': 129, 'entities': [('浴室', '场所类'), ('卫生间', '场所类')], 'relations': []}, {'id': 130, 'entities': [('白色', '色彩'), ('烤漆柜门', '家具物体'), ('格子砖', '家具物体')], 'relations': [('烤漆柜门', '颜色', '白色')]}, {'id': 131, 'entities': [('卫生间', '场所类'), ('干湿分区', '户型布局'), ('浅灰色', '色彩'), ('大理石瓷砖', '家具物体'), ('淋浴房', '场所类'), ('钻石型', '术语'), ('黑色', '色彩'), ('边框', '家具物体'), ('极窄', '外形'), ('悬挂式', '术语'), ('洗手台', '家具物体'), ('墙地面', '局部')], 'relations': [('干湿分区', '空间', '卫生间'), ('大理石瓷砖', '颜色', '浅灰色'), ('淋浴房', '属性', '钻石型'), ('边框', '形状', '极窄'), ('边框', '颜色', '黑色'), ('洗手台', '属性', '悬挂式'), ('墙地面', '材质', '大理石瓷砖'), ('卫生间', '方位', '墙地面')]}, {'id': 132, 'entities': [('主卫', '场所类'), ('浴缸', '家具物体'), ('百叶窗', '家具物体'), ('梳妆台', '家具物体'), ('洗漱区', '局部'), ('一体设计', '术语')], 'relations': [('主卫', '物体', '浴缸'), ('主卫', '物体', '百叶窗'), ('主卫', '方位', '洗漱区'), ('一体设计', '属性', '洗漱区'), ('一体设计', '属性', '梳妆台')]}, {'id': 133, 'entities': [('入墙式', '术语'), ('龙头', '家具物体'), ('岩板一体盆', '家具物体')], 'relations': [('龙头', '属性', '入墙式')]}, {'id': 134, 'entities': [('卫生间', '场所类'), ('三分离', '户型布局'), ('嵌入式', '术语'), ('水箱', '家具物体'), ('悬挂式', '术语'), ('马桶', '家具物体'), ('大理石', '家具物体')], 'relations': [('水箱', '属性', '嵌入式'), ('马桶', '属性', '悬挂式'), ('三分离', '空间', '卫生间'), ('卫生间', '物体', '大理石')]}, {'id': 136, 'entities': [('卫生间', '场所类'), ('亚光', '术语'), ('瓷砖', '家具物体'), ('主卫', '场所类'), ('浴室柜', '家具物体'), ('大长条', '外形')], 'relations': [('浴室柜', '形状', '大长条'), ('主卫', '物体', '浴室柜'), ('卫生间', '物体', '瓷砖'), ('瓷砖', '属性', '亚光')]}, {'id': 137, 'entities': [('厨房', '场所类'), ('厨房', '场所类'), ('餐厅', '场所类'), ('厨房', '场所类'), ('柜子', '家具物体'), ('纯白', '色彩'), ('黑色', '色彩'), ('操作台', '家具物体'), ('开放式', '户型布局'), ('客餐', '场所类')], 'relations': [('柜子', '颜色', '纯白'), ('操作台', '颜色', '黑色'), ('开放式', '空间', '厨房'), ('开放式', '空间', '餐厅')]}, {'id': 138, 'entities': [('主卧', '场所类'), ('冰川灰', '色彩'), ('壁布', '家具物体'), ('肌底色', '色彩'), ('焦糖色', '色彩'), ('绒布窗帘', '家具物体'), ('现代风', '风格类'), ('白色', '色彩'), ('衣柜', '家具物体'), ('深木色', '色彩'), ('衣帽柜', '家具物体')], 'relations': [('壁布', '颜色', '冰川灰'), ('绒布窗帘', '颜色', '焦糖色'), ('衣柜', '颜色', '白色'), ('衣帽柜', '颜色', '深木色'), ('主卧', '颜色', '肌底色'), ('主卧', '物体', '绒布窗帘'), ('主卧', '物体', '衣柜'), ('主卧', '物体', '衣帽柜'), ('主卧', '风格', '现代风')]}, {'id': 139, 'entities': [('卧室', '场所类'), ('蓝色', '色彩')], 'relations': [('卧室', '颜色', '蓝色')]}, {'id': 141, 'entities': [('L型', '外形'), ('小厨房', '场所类'), ('壁龛', '家具物体'), ('橱柜', '家具物体'), ('银灰色', '色彩'), ('门板', '家具物体'), ('地面瓷砖', '家具物体')], 'relations': [('小厨房', '形状', 'L型'), ('门板', '颜色', '银灰色'), ('小厨房', '物体', '壁龛')]}, {'id': 142, 'entities': [('阳台', '场所类'), ('书房', '场所类'), ('茶室', '场所类'), ('15公分', '数量'), ('主桌', '家具物体')], 'relations': [('主桌', '高', '15公分'), ('书房', '物体', '主桌'), ('茶室', '物体', '主桌')]}, {'id': 143, 'entities': [('主卧', '场所类'), ('窗', '家具物体'), ('墙面', '局部'), ('鸡蛋壳色', '色彩'), ('深棕色', '色彩'), ('布艺床', '家具物体'), ('衣柜', '家具物体'), ('衣柜', '家具物体'), ('实木衣柜', '家具物体'), ('乳胶漆', '组分')], 'relations': [('主卧', '物体', '窗'), ('主卧', '方位', '墙面'), ('乳胶漆', '颜色', '鸡蛋壳色'), ('墙面', '材质', '乳胶漆'), ('布艺床', '颜色', '深棕色'), ('主卧', '物体', '布艺床')]}, {'id': 145, 'entities': [('书房', '场所类'), ('木色', '色彩'), ('放置架', '家具物体')], 'relations': [('放置架', '颜色', '木色'), ('书房', '物体', '放置架')]}, {'id': 146, 'entities': [('卧室', '场所类'), ('客厅', '场所类'), ('蓝色', '色彩'), ('化妆凳', '家具物体'), ('抱枕', '家具物体')], 'relations': [('卧室', '颜色', '蓝色')]}, {'id': 147, 'entities': [('西厨加餐岛', '术语')], 'relations': []}, {'id': 259, 'entities': [('88w+', '数量'), ('现代法式', '风格类'), ('185万', '数量'), ('公寓', '户型布局'), ('豪华装修', '术语')], 'relations': [('公寓', '风格', '现代法式'), ('公寓', '费用', '88w+'), ('公寓', '费用', '185万'), ('公寓', '属性', '豪华装修')]}, {'id': 260, 'entities': [('L形', '外形'), ('大飘窗', '家具物体'), ('主卧', '场所类')], 'relations': [('主卧', '物体', '大飘窗'), ('大飘窗', '形状', 'L形')]}, {'id': 262, 'entities': [('两室一厅', '户型布局'), ('88㎡', '数量'), ('300W', '数量'), ('500平米', '数量'), ('800万', '数量'), ('法式', '风格类'), ('别墅', '户型布局')], 'relations': [('两室一厅', '面积', '88㎡'), ('两室一厅', '费用', '300W'), ('别墅', '风格', '法式'), ('别墅', '面积', '500平米'), ('别墅', '费用', '800万')]}, {'id': 263, 'entities': [('套内76平', '数量'), ('2房2厅', '户型布局'), ('2厅2房', '户型布局'), ('客厅', '场所类'), ('背景墙', '局部'), ('岩板', '家具物体'), ('木饰面', '家具物体'), ('地面', '局部'), ('灰色', '色彩'), ('瓷砖', '家具物体'), ('半开放式', '户型布局'), ('书房', '场所类'), ('隔断', '局部'), ('灰玻', '组分'), ('书柜', '家具物体'), ('橘色', '色彩'), ('皮纹层板', '家具物体'), ('儿童房', '场所类'), ('地板', '局部'), ('鱼骨拼', '外形')], 'relations': [('2房2厅', '面积', '套内76平'), ('2厅2房', '面积', '套内76平'), ('客厅', '方位', '背景墙'), ('背景墙', '材质', '岩板'), ('背景墙', '材质', '木饰面'), ('客厅', '方位', '地面'), ('瓷砖', '颜色', '灰色'), ('地面', '材质', '瓷砖'), ('半开放式', '空间', '书房'), ('隔断', '材质', '灰玻'), ('皮纹层板', '颜色', '橘色'), ('书柜', '装饰', '皮纹层板'), ('地板', '材质', '鱼骨拼'), ('儿童房', '方位', '地板'), ('书房', '方位', '隔断'), ('书房', '物体', '书柜')]}, {'id': 264, 'entities': [('小户型', '户型布局'), ('两室', '户型布局'), ('浴室柜子', '家具物体'), ('50m²', '数量'), ('浴室柜台面', '家具物体'), ('杜邦一体台面', '品牌')], 'relations': [('浴室柜子', '面积', '50m²'), ('浴室柜台面', '品牌名', '杜邦一体台面')]}, {'id': 265, 'entities': [('轻奢北欧风', '风格类'), ('极简', '风格类'), ('卫生间', '场所类'), ('爵士白', '色彩'), ('大理石瓷砖墙', '家具物体'), ('卫生间', '场所类'), ('花洒', '家具物体'), ('北欧风', '风格类'), ('ins风', '风格类')], 'relations': [('卫生间', '风格', '轻奢北欧风'), ('卫生间', '风格', '极简'), ('大理石瓷砖墙', '颜色', '爵士白'), ('卫生间', '物体', '大理石瓷砖墙'), ('卫生间', '物体', '花洒'), ('花洒', '风格', '北欧风'), ('花洒', '风格', 'ins风')]}]
    entities, relations= set(), set()
    for d in jdat:
        if d.get('entities'):
            entities.update(d.get('entities'))
        if d.get("relations"):
            relations.update(d.get('relations'))
    entities = list(entities)
    relations= list(relations)

    # 创建有向图网络
    G = nx.DiGraph()
    for ent in entities:
        G.add_node(ent[0], desc=ent[1])
    for rel in relations:
        G.add_edge(rel[0], rel[2], name=rel[1])

    ## 标签处理
    nnames = {}
    for i, node in enumerate(G.nodes):
        desc = entities[i][1]
        nnames[node]=f"{node}\n{desc}"
    enames = nx.get_edge_attributes(G, 'name')

    pos = nx.spring_layout(G)
    nx.draw(G, pos, node_color='r', edge_color='b')
    nx.draw_networkx_labels(G, pos, labels=nnames, font_color='g')
    nx.draw_networkx_edge_labels(G, pos, edge_labels=enames)

    nt = net.Network(height='1000px', width='2000px', bgcolor="black", font_color='white', notebook=True)
    nt.from_nx(G)
    nt.hrepulsion()
    save_html = 'demo.html'
    nt.show(save_html)
    display(HTML(save_html))
    plt.show()


def demo4():
    from pyvis.network import Network

    net = Network()
    net.add_node(1, label='Node 1')
    net.add_node(2, label='Node 2')
    net.add_nodes([3, 4, 5],
                  value=[10, 20, 30],
                  title=["I am node 3", "node 4 here", "and im node 5"],
                  x=[21.4, 54.2, 11.2],
                  y=[100.2, 23.54, 32.1],
                  label=["NODE 3", "NODE 4", "NODE 5"],
                  color=["#00ff1e", "#162347", "#dd4b39"])

    # 显示，输出为demo1.html
    net.show('demo1.html')

if __name__ == '__main__':
    print()
    # demo()
    # demo2()
    # demo3()
    demo4()